silkmonger/Esp32_UDP_node/sketch/command_handler.cpp
#include "esp32-hal-gpio.h"
#include "string.h"
#include "sys/_types.h"
#include <sys/stat.h>
#include "stdint.h"
#include <WiFi.h>

#include "shared_vars.h"
extern char string_var[][STRING_VARS_SIZE];
extern unsigned long count;
extern String  wired_lan_mac_address;
extern bool    wired_lan_connection;
extern uint8_t wifi_reconnect_count;
extern bool    display_ok;

extern uint8_t led_pin_number;
extern bool    led_pin_enabled;
extern bool    led_polarity;

// extern
void debug_error(String);
void reset_loop_counter(void); // external function prototype
uint32_t pn_get_request_test(void);
uint32_t pn_openweather_get_request(void);
void pn_parse_json_test(void);
uint32_t pn_test_post_request(void);
uint32_t pn_push_notification(void);
uint32_t pn_set_pushover_credentials(void);
uint16_t pn_set_push_notification_text(uint8_t string_var_index);
uint16_t pn_set_gpio_notification_text(uint8_t string_var_index);
uint32_t pn_gpio_enable(uint8_t, bool, uint16_t, uint16_t);
uint8_t pn_read_numbers_list_1(uint8_t* write_ptr);
void oled_text(String, String);
void led_on(bool turn_it_on);

namespace my_CH
{
  const int VERSION1 = 1;
  const int OK_STATUS = 0;
  const int NOTOK_STATUS = 1;
  const int BAD_COMMAND_STATUS = 2;

  const int V1_CMD_NOP                        = 0;
  const int V1_CMD_RESET_LOOP_COUNTER         = 1;
  const int V1_CMD_READ_UINT16                = 2;
  const int V1_CMD_GET_RANDOM_32BIT           = 3;
  const int V1_CMD_TEST_HTTP_GET              = 4;
  const int V1_CMD_WEATHER_REQUEST            = 5;
  const int V1_CMD_QUICK_BROWN_FOX            = 6;
  const int V1_CMD_READ_STRING_VAR            = 7;
  const int V1_CMD_WRITE_STRING_VAR           = 8;
  const int V1_CMD_PARSE_JSON_TEST            = 9;
  const int V1_CMD_POST_REQUEST_TEST          = 10;
  const int V1_CMD_PUSH_NOTIFICATION          = 11;
  const int V1_CMD_GET_MAC_ADDRESS            = 12;
  const int V1_CMD_SET_PUSHOVER_CREDENTIALS   = 13;
  const int V1_CMD_READ_UINT32                = 14;
  const int V1_CMD_SET_PUSH_NOTIFICATION_TEXT = 15;
  const int V1_CMD_OLED_TEXT                  = 16;
  const int V1_CMD_SET_LED_PIN                = 17;
  const int V1_CMD_READ_OVER_STRING_VAR       = 18;
  const int V1_CMD_CONFIG_PUSHOVER_GPIO       = 19;
  const int V1_CMD_READ_LIST                  = 20;
  const int V1_CMD_WRITE_INTEGER              = 21;
  const int V1_CMD_RESERVED                   = 32;  // for extended commands. if first octet is 0x20, additional three octets build the opcode, making for 16777216 (2^24) additional opcodes

  const int V1_UINT16_VARIABLE_ZERO_CONST           = 0;
  const int V1_UINT16_VARIABLE_LOOP_COUNTER         = 1;
  const int V1_UINT16_VARIABLE_STR_VAR_ATTRIBUTES   = 2;
  const int V1_UINT16_VARIABLE_SKETCH_DATE_CODE     = 3;
  const int V1_UINT16_VARIABLE_MAX_RESP_SIZE        = 4;
  const int V1_UINT16_VARIABLE_WIFI_RSSI            = 5;
  const int V1_UINT16_VARIABLE_WIFI_RECONNECT_COUNT = 6;
  const int V1_UINT16_VARIABLE_GPIO_INPUT_VALUE     = 7;
  // const int V1_UINT16_VARIABLE_WIFI_BSSID           = 7; // need to remove this!! replaced by 'V1_CMD_READ_BSSID_AS_STRING'

  const uint16_t V1_READ_NUMBERS_LIST_0_THROUGH_32        = 0;
  const uint16_t V1_READ_NUMBERS_LIST_PUSH_NOTIFICATION_1 = 1;

  const uint16_t V1_WRITE_INT_ID_CLIENT_VERSION           = 0;

  const int V1_READ_OVER_STRVAR_QBF                 = 0x0000;
  const int V1_READ_OVER_STRVAR_WIFIBSSID           = 0x0001;

  const int V1_UINT32_VARIABLE_ZERO_CONST         = 0;
  const int V1_UINT32_VARIABLE_SKETCH_DATE_CODE   = 1;

  char* cmd_request_buffer;
  int   cmd_request_length;

  const int MAX_RESPONSE_SIZE = 128;            // this is where 'command handler' places header + payload
  const int RESPONSE_TRAILER_SIZE = 6;          // this is where UDP logic adds sequence number and CRC32
  uint8_t response_buffer[MAX_RESPONSE_SIZE + RESPONSE_TRAILER_SIZE];
  unsigned response_length;

  uint16_t udp_client_version;                  // version of python (typically) client we talk to over UDP

  const uint8_t V1_RESPONSE_STATUS_OK = 0;
  const uint8_t V1_RESPONSE_STATUS_NOTOK = 1;

  // private function prototypes
  void quick_brown_fox_response(void);
  uint8_t build_v1_read_string_variable_response(uint8_t);
  bool perform_read_to_string_variable(uint8_t, uint16_t);
  bool build_read_list_response(uint16_t);
  bool write_integer_handler(uint16_t);

  uint8_t variable_index;
  uint16_t ros_index;             // read over string
  String mac_address_string;
  uint32_t rv32bit;

  void build_v1_response_uint32_t_payload(uint8_t status, uint32_t payload)
  {
    response_buffer[0] = VERSION1;
    response_buffer[1] = status;
    response_buffer[2] = (payload >> 0) & 0xFF;
    response_buffer[3] = (payload >> 8) & 0xFF;
    response_buffer[4] = (payload >> 16) & 0xFF;
    response_buffer[5] = (payload >> 24) & 0xFF;
    response_length = 6;
  } // void build_v1_response_uint32_t_payload


  void build_v1_response_uint16_t_payload(uint8_t status, uint16_t payload)
  {
    response_buffer[0] = 1;
    response_buffer[1] = status;
    response_buffer[2] = (payload >> 0) & 0xFF;
    response_buffer[3] = (payload >> 8) & 0xFF;
    response_length = 4;
  } // void build_v1_response_uint16_t_payload

  void read_v1_16bit_variable(int variable_id)
  {
    Serial.println("Read 16 bit variable "+String(variable_id));
    uint8_t* bssid_ptr;
    uint8_t  arg1;
    int      intvar1;

    switch(variable_id)
    {
      case V1_UINT16_VARIABLE_ZERO_CONST:
        build_v1_response_uint16_t_payload(OK_STATUS, 0);
        break;

      case V1_UINT16_VARIABLE_LOOP_COUNTER:
        build_v1_response_uint16_t_payload(OK_STATUS, count);
        break;

      case V1_UINT16_VARIABLE_STR_VAR_ATTRIBUTES:
        build_v1_response_uint16_t_payload(OK_STATUS, STRING_VARS_COUNT | (STRING_VARS_SIZE << 8));
        break;

      case V1_UINT16_VARIABLE_SKETCH_DATE_CODE:
        build_v1_response_uint16_t_payload(OK_STATUS, SKETCH_16BIT_DATE_CODE);
        break;

      case V1_UINT16_VARIABLE_MAX_RESP_SIZE:
        build_v1_response_uint16_t_payload(OK_STATUS, MAX_RESPONSE_SIZE);
        break;

