silkmonger/Esp32_UDP_node/sketch/command_handler.cpp
      case V1_UINT16_VARIABLE_WIFI_RSSI:
        if(!wired_lan_connection)
          build_v1_response_uint16_t_payload(OK_STATUS, 256+WiFi.RSSI());
        else
          build_v1_response_uint16_t_payload(NOTOK_STATUS, 0xdead);
        break;

      case V1_UINT16_VARIABLE_WIFI_RECONNECT_COUNT:
        build_v1_response_uint16_t_payload(wired_lan_connection ? NOTOK_STATUS : OK_STATUS, wifi_reconnect_count);
        break;

      case V1_UINT16_VARIABLE_GPIO_INPUT_VALUE:
        if(cmd_request_length != 9)
        {
          Serial.println("[NOTOK] 'V1_UINT16_VARIABLE_GPIO_INPUT_VALUE' bad request length (expected 9 octets, received " + String(cmd_request_buffer) + ")");
          build_v1_response_uint16_t_payload(NOTOK_STATUS, 0xDEAD);
        }
        else
        {
          arg1 = cmd_request_buffer[3];            // GPIO pin number
          if((arg1 & 0x80) == 0x00)
          {
            pinMode(arg1, INPUT);
          }
          else
          {
            Serial.println("Note: reading pin " + String(arg1 & 0x7f) + " without setting pinMode(INPUT)");
          }
          intvar1 = digitalRead(arg1 & 0x7f);
          build_v1_response_uint16_t_payload(OK_STATUS, intvar1);
        }
        break;

      // case V1_UINT16_VARIABLE_WIFI_BSSID:
      //   build_v1_response_uint16_t_payload(NOTOK_STATUS, 0xDEAD);
      //   Serial.print("WiFi.BSSIDstr() : " + WiFi.BSSIDstr() + ", or using WiFi.BSSID() :");
      //   bssid_ptr = WiFi.BSSID();
      //   for(int i=0; i<6; i++)
      //     Serial.print(" " + String(bssid_ptr[i]));
      //   Serial.println("");
      //   break;

      default:
        build_v1_response_uint16_t_payload(NOTOK_STATUS, 0);
        break;      
    } // switch( variable_id )
  } // void read_v1_16bit_variable(int variable_id)

  void read_v1_32bit_variable(int variable_id)
  {
    Serial.println("Read 32 bit variable " + String(variable_id));
    uint32_t payload_32bit;
    switch( variable_id )
    {
      case V1_UINT32_VARIABLE_ZERO_CONST:
        build_v1_response_uint32_t_payload(OK_STATUS, 0);
        break;

      case V1_UINT32_VARIABLE_SKETCH_DATE_CODE:
        // bits[31:16] - year
        // bits [15:8] - month
        //  bits [7:0] - day
        // new data code: [31:20][19:16][15:10][9:0] for {year, month, day, intraday_rev}, respectively
        //paylod_32bit = (SKETCH_YEAR_MONTH_DAY[0] << 16) | (SKETCH_YEAR_MONTH_DAY[1] << 8) | SKETCH_YEAR_MONTH_DAY[2];
        payload_32bit = (SKETCH_YEAR_MONTH_DAY[0] << 20) | (SKETCH_YEAR_MONTH_DAY[1] << 16)
                      | (SKETCH_YEAR_MONTH_DAY[2] << 10) | (SKETCH_INTRADAY_REV & 0x3FF);
        Serial.println("32bit date code : 0x" + String(payload_32bit, HEX));
        build_v1_response_uint32_t_payload(OK_STATUS, payload_32bit);
        break;

      default:
        Serial.println("[NOTOK] 32bit variable id 0x" + String(variable_id, HEX) + " is not defined");
        build_v1_response_uint32_t_payload(BAD_COMMAND_STATUS, 0);
        break;
    } // switch statement
  } // void read_v1_32bit_variable(int variable_id)

  unsigned handle_char_buffer_command_message(char * buffer, int length)
  {
    cmd_request_buffer = buffer;
    cmd_request_length = length;
    Serial.println("myCH::handle_char_buffer_command_message");
    response_length = 0;
    if(length >= 2)
      {
      if(int(buffer[0] == VERSION1))
      {
        int v1_command = int(buffer[1]);
        int variable_id;
        long r = 0;
        uint32_t http_result;
        uint16_t uint16_arg_1;
        uint16_t uint16_arg_2;
        uint8_t line1_index;
        uint8_t line2_index;
        bool    bool_arg_1;
        Serial.println("myCH::handle_char_buffer_command_message -> V1 command " + String(v1_command));
        switch(v1_command)
        {
          case V1_CMD_NOP:
            break;

          case V1_CMD_RESET_LOOP_COUNTER:
            Serial.println("resetting loop counter");
            reset_loop_counter();
            break;

          case V1_CMD_READ_UINT16:
            Serial.println("'V1_CMD_READ_UINT16'");
            // expecting [version, opcode, register_id] + [seq.no] + [crc32]
            if(length >= 3+5)
            {
              variable_id = int(buffer[2]);
              read_v1_16bit_variable(variable_id);
            }
            else
            {
              Serial.println("*E 'V1_CMD_READ_UINT16' - length (" + String(length) + ") is less than 3+5");
            }
            break;

          case V1_CMD_GET_RANDOM_32BIT:
            r = random(0x10000);
            Serial.println("'V1_CMD_GET_RANDOM_32BIT': random value: " + String(r));
            build_v1_response_uint32_t_payload(V1_RESPONSE_STATUS_OK, uint32_t(r));
            break;
          
          case V1_CMD_TEST_HTTP_GET:
            Serial.println("'V1_CMD_TEST_HTTP_GET'");
            http_result = pn_get_request_test();
            build_v1_response_uint32_t_payload(V1_RESPONSE_STATUS_OK, http_result);
            break;
          
          case V1_CMD_WEATHER_REQUEST:
            Serial.println("'V1_CMD_WEATHER_REQUEST'");
            http_result = pn_openweather_get_request();
            build_v1_response_uint32_t_payload(V1_RESPONSE_STATUS_OK, http_result);
            break;

          case V1_CMD_QUICK_BROWN_FOX:
            Serial.println("'V1_CMD_QUICK_BROWN_FOX'");
            quick_brown_fox_response();
            break;

          case V1_CMD_READ_STRING_VAR:
            Serial.println("'V1_CMD_READ_STRING_VAR'");
            if(length == 3+5)
            {
              variable_index = buffer[2];
              build_v1_read_string_variable_response(variable_index);
            }
            else
            {
              Serial.println("*E: bad length");
              build_v1_response_uint32_t_payload(NOTOK_STATUS, 0xDEADBEEF);
            }
            break;

          /*---------------------------------------------------------------------------------------------
            Write String Variable command format:
            - version (one octet)
            - opcode (one octet)
            - variable index (one octet)
            - string characters (multiple octets)
            - CRC32 (four octets)
            ---------------------------------------------------------------------------------------------*/
          case V1_CMD_WRITE_STRING_VAR:
            Serial.println("'V1_CMD_WRITE_STRING_VAR' (length: " + String(length) + ")");
            // uint8_t variable_index;
            variable_index = buffer[2];
            
