silkmonger/Esp32_UDP_node/sketch/command_handler.cpp
            if(variable_index < STRING_VARS_COUNT)
            {              
              uint8_t text_length = length-8;
              if(text_length < STRING_VARS_SIZE-1)
              {
                Serial.println("[OK] variable index = " +  String(variable_index) + ", text length: " + String(text_length));
                build_v1_response_uint32_t_payload(OK_STATUS, length);
                char * source_pointer = &(buffer[3]);
                for(uint8_t i=0; i<text_length; i++)
                  string_var[variable_index][i] = *(source_pointer++);
                string_var[variable_index][text_length] = NULL;
              }
              else
              {
                Serial.println("[NOTOK] text is too long (" + String(text_length) + ") chars");
                build_v1_response_uint32_t_payload(NOTOK_STATUS, 0xdeadbeef);
              }
            }
            else
            {
              Serial.println("[NOTOK] variable index = " + String(variable_index));
              build_v1_response_uint32_t_payload(NOTOK_STATUS, 0xdeadbeef);
            }
            break;

          case V1_CMD_PARSE_JSON_TEST:
            Serial.println("'V1_CMD_PARSE_JSON_TEST'");
            pn_parse_json_test();
            build_v1_response_uint32_t_payload(OK_STATUS, 0);
            break;

          case V1_CMD_POST_REQUEST_TEST:
            Serial.println("'V1_CMD_POST_REQUEST_TEST'");
            http_result = pn_test_post_request();
            build_v1_response_uint32_t_payload(V1_RESPONSE_STATUS_OK, http_result);
            break;

          case V1_CMD_PUSH_NOTIFICATION:
            Serial.println("'V1_CMD_PUSH_NOTIFICATION'");
            rv32bit = pn_push_notification(); // HTTP response character count, DEADBEEF for error
            build_v1_response_uint32_t_payload(rv32bit == 0xDEADBEEF ? NOTOK_STATUS : OK_STATUS, rv32bit);
            break;

          case V1_CMD_GET_MAC_ADDRESS:
            Serial.println("'V1_CMD_GET_MAC_ADDRESS'");
            // if(wired_lan_mac_address.length() > 1)
            if(wired_lan_connection)
              mac_address_string = wired_lan_mac_address + ",802.3";
            else
              mac_address_string = WiFi.macAddress() + ",802.11";
            Serial.println("MAC address: " + mac_address_string);
            if(mac_address_string.length() < STRING_VARS_SIZE)
            {
              strcpy(string_var[0], mac_address_string.c_str());
              build_v1_read_string_variable_response(0);
            }
            else
            {
              Serial.println("[NOTOK] MAC address string too long");
              build_v1_response_uint32_t_payload(NOTOK_STATUS, 0xdeadbeef);
            }
            break;

          case V1_CMD_SET_PUSHOVER_CREDENTIALS:
            Serial.println("'V1_CMD_SET_PUSHOVER_CREDENTIALS'");
            rv32bit = pn_set_pushover_credentials();
            build_v1_response_uint32_t_payload(rv32bit==OK_STATUS_32b ? OK_STATUS : NOTOK_STATUS, rv32bit);
            break;

          case V1_CMD_READ_UINT32:
            variable_id = int(buffer[2]);
            Serial.println("'V1_CMD_READ_UINT32' [0x" + String(variable_id, HEX) + "]");
            read_v1_32bit_variable(variable_id);
            break;

          case V1_CMD_SET_PUSH_NOTIFICATION_TEXT:
            // command copies specified string variable  to push notification test buffer
            variable_id = int(buffer[2] & 0x7F);
            bool_arg_1 = (buffer[2] & 0x80) == 0x80 ? true : false;  // UDP command vs GPIO event notification text
            Serial.println("'V1_CMD_SET_PUSH_NOTIFICATION_TEXT' (string var " + String(variable_id) + ", " +  
                           String(bool_arg_1 ? "GPIO event" : "UDP command") + ")");
            // Serial.println("[NOTOK] command logic not implemented");
            if(bool_arg_1)
              uint16_arg_1 = pn_set_gpio_notification_text(variable_id);
            else
              uint16_arg_1 = pn_set_push_notification_text(variable_id);
            build_v1_response_uint16_t_payload(uint16_arg_1>0 ? OK_STATUS : NOTOK_STATUS, uint16_arg_1);
            if(uint16_arg_1 == 0) debug_error("failed to set push notification text");
            break;

          case V1_CMD_OLED_TEXT:
            // two octets following the opcode, determine string variables to be used for text lines 1 and 2
            line1_index = (uint8_t)buffer[2];
            line2_index = (uint8_t)buffer[3];
            Serial.println("'V1_CMD_OLED_TEXT(" + String(line1_index) + ", " + String(line2_index) + ")'");
            if(!display_ok)
            {
              debug_error("display device error");
              build_v1_response_uint16_t_payload(NOTOK_STATUS, 0);
            }
            else if(max(line1_index, line2_index) >= STRING_VARS_COUNT)
            {
              debug_error("string indices out of bounds");
              build_v1_response_uint16_t_payload(NOTOK_STATUS, 1);
            }              
            else if(max(strlen(string_var[line1_index]), strlen(string_var[line2_index])) < MIN(20, STRING_VARS_SIZE))
            {
              oled_text(String(string_var[line1_index]), String(string_var[line2_index]));
              build_v1_response_uint16_t_payload(OK_STATUS, strlen(string_var[line1_index]) | (strlen(string_var[line2_index]) << 8));
            }
            else
            {
              debug_error("string variables too long");
              build_v1_response_uint16_t_payload(NOTOK_STATUS, 2);
            }
            break;

          case V1_CMD_SET_LED_PIN:
            // command takes one octet as argument. bits [5:0] are pin number (0 to disable), bit [7] is
            // the GPIO digitalWrite value, which is written right after pinMode is set to OUTPUT.
            // bit [6] is LED polarity '1' (true) for HIGH=LED on, '0' for LOW=LED on.
            line1_index = (uint8_t)buffer[2];
            Serial.println("'V1_CMD_SET_LED_PIN' " + String(line1_index & 0x3F) + ", " + String(line1_index >> 7) + ", " + String((line1_index >> 6) & 0x01));
            if(led_pin_enabled && ((line1_index & 0x3F) != led_pin_number))
            {
              pinMode(led_pin_number, INPUT);
            }
            led_pin_number = line1_index & 0x3F;
            led_polarity = (line1_index & 0x40) == 0x40 ? true : false;
            if(led_pin_number == 0)
              led_pin_enabled = false;
            else
            {
              led_pin_enabled = true;
              pinMode(led_pin_number, OUTPUT);
              Serial.println("Turning LED " + String(((uint8_t)buffer[2] & 0x80) == 0x80 ? "ON" : "OFF") + " (GPIO " + String(led_pin_number) + ")");
              led_on( ((uint8_t)buffer[2] & 0x80) == 0x80 );
            }
            build_v1_response_uint16_t_payload(OK_STATUS, line1_index);
            break;

          case V1_CMD_READ_OVER_STRING_VAR:
            // this opcode copies BSSID string to a string variable selected by first octet argument.
            // response packet is a stadard 'read string variable' response xxxx
            variable_index = (uint8_t)buffer[2];
            ros_index = (uint8_t)buffer[3] + ((uint8_t)buffer[4] << 8);
            if(perform_read_to_string_variable(variable_index, ros_index))
            {
              build_v1_read_string_variable_response(variable_index);
            }
            else
            {
              build_v1_response_uint32_t_payload(NOTOK_STATUS, 0xdeadbeef);
            }
            // if(variable_index < STRING_VARS_COUNT)
            // {
            //   Serial.println("'V1_CMD_READ_OVER_STRING_VAR' (via string variable " + String(variable_index) + ")");
            //   // strcpy(string_var[variable_index], WiFi.BSSIDstr().toCharArray(char *buf, unsigned int bufsize));
            //   // WiFi.BSSIDstr().toCharArray(string_var[variable_index], STRING_VARS_SIZE);
            //   build_v1_read_string_variable_response(variable_index);
            // }
            // else
            // {
            //   Serial.println("[NOTOK] either variable index is too high (" + String(variable_index) + "), or we are on wired LAN");
            //   build_v1_response_uint32_t_payload(NOTOK_STATUS, 0xdeadbeef);
            // }
            break;

          case V1_CMD_CONFIG_PUSHOVER_GPIO:
            // 2023/04/12 - defined, not implemented
            // arguments:
            //   first octet: [6:0] - pin number, [7] - polarity
            //   second and third octets: beckoff seconds (0 to 2^16)
            // response payload (uint32_t):
            //   backoff window size, in milliseconds
            line1_index = (uint8_t)buffer[2] & 0x7F;                              // pin number
            bool_arg_1 = (uint8_t)buffer[2] & 0x08 == 0x08 ? false : true;        // polarity
            uint16_arg_1 = (uint8_t)buffer[3] + ((uint8_t)buffer[4] << 8);        // backoff window (seconds)
            uint16_arg_2 = (uint8_t)buffer[5] + ((uint8_t)buffer[6] << 8);        // debounce window (seconds)
            Serial.println("'V1_CMD_CONFIG_PUSHOVER_GPIO' " + 
                           String(line1_index) + ", " + String(bool_arg_1) + ", " + 
                           String(uint16_arg_1) + " seconds backoff, " +
                           String(uint16_arg_2) + " seconds debounce");
            // pn_gpio_enable( line1_index,
            //                 bool_arg_1,
            //                 uint16_arg_1 );
            build_v1_response_uint32_t_payload(OK_STATUS, pn_gpio_enable(line1_index, bool_arg_1, uint16_arg_1, uint16_arg_2));
            break;

          case V1_CMD_READ_LIST:
            // 2023/04/14 - new command to read lists of numbers
            // arguments: 16bit read content select
            uint16_arg_1 = (uint8_t)buffer[2] + ((uint8_t)buffer[3] << 8);
            Serial.println("'V1_CMD_READ_LIST' " + String(uint16_arg_1));
            if(build_read_list_response(uint16_arg_1))
              Serial.println("[OK] response length = " + String(response_length));
            else
              Serial.println("[NOTOK] failed preparing response");
            // build_v1_response_uint32_t_payload(NOTOK_STATUS, 0xDEADBEEF);
            break;

          case V1_CMD_WRITE_INTEGER:
            // 2023/04/15 - new command to write integer
            // arguments: 16bit write content select
            //   payload: one or more bytes to construct integer value (index dependant, little endian)
            uint16_arg_1 = (uint8_t)buffer[2] + ((uint8_t)buffer[3] << 8);
            Serial.println("'V1_CMD_WRITE_INTEGER' " + String(uint16_arg_1));
            build_v1_response_uint32_t_payload(write_integer_handler(uint16_arg_1) ? V1_RESPONSE_STATUS_OK : V1_RESPONSE_STATUS_NOTOK, 0x0);
            break;

          default:
            Serial.println("[NOTOK] no command handler for opcode " + String(v1_command));
            build_v1_response_uint32_t_payload(NOTOK_STATUS, 0xDEADBEEF);
            break;
        
        } // switch(v1_command)
      }
      else
      {
        Serial.println("myCH::handle_char_buffer_command_message -> *** NOT a V1 command ***");
      }
    }
    else // too short
    {
      Serial.println("myCH::handle_char_buffer_command_message -> length < 2");
    }
    return response_length;
  } // unsigned handle_char_buffer_command_message

  void quick_brown_fox_response(void)
  {
    const char qbf_string[] = "the quick brown fox\0";
    response_buffer[0] = VERSION1;
    response_buffer[1] = OK_STATUS;
    strcpy((char *)(&response_buffer[2]), qbf_string);
    response_length = 2 + strlen(qbf_string);
  } // void quick_brown_fox_response(void)

  uint8_t build_v1_read_string_variable_response(uint8_t variable_index)
  {
    char * source_pointer;
    if(variable_index < STRING_VARS_COUNT)
    {
      source_pointer = string_var[variable_index];
      Serial.println("building response for read string variable(" + String(variable_index) + ")");
      response_buffer[0] = VERSION1;
      response_buffer[1] = OK_STATUS;
      strcpy((char *)(&response_buffer[2]), source_pointer);
      // strcpy((char *)(&response_buffer[2]), "abcdefg\0"); // xxxx
      response_length = 2 + strlen(source_pointer);
      // response_length = 2 + strlen("abcdefg\0");
      Serial.println("len(string variable[" + String(variable_index) + "]) = " + String(strlen(source_pointer)));
      return 0;
    }
    else
    {
      build_v1_response_uint32_t_payload(NOTOK_STATUS, 0xDEADBEEF);
      return 1;
    }
  } // uint8_t build_v1_read_string_variable_response(uint8_t variable_index)

  bool perform_read_to_string_variable(uint8_t var_index, uint16_t switch_index)
  {
    if(var_index >= STRING_VARS_COUNT)
    {
      Serial.println("[NOTOK] string variable index (" + String(var_index) + ") out of bounds");
      return false;
    }

    bool success = true;

