silkmonger/Esp32_UDP_node/sketch/command_handler.cpp
    switch(switch_index)
    {
      case V1_READ_OVER_STRVAR_QBF:
        Serial.println("reading 'the quick brown fox' via string variable " + String(var_index));
        strcpy(string_var[var_index], "the quick brown fox");
        break;

      case V1_READ_OVER_STRVAR_WIFIBSSID:
        if(wired_lan_connection)
        {
          success = false;
        }
        else
        {
          WiFi.BSSIDstr().toCharArray(string_var[var_index], STRING_VARS_SIZE);
          Serial.println("writing BSSID string '" + String(string_var[var_index]) + "' to string variable " + String(var_index));
        }
        break;
        
      default:
        success = false;
        break;
    }
    return success;
  } // bool perform_read_to_string_variable(uint8_t var_index, uint16_t switch_index)

  bool build_read_list_response(uint16_t list_id)
  {
    bool valid_id = true;
    response_length = 2;
    switch(list_id)
    {
      case V1_READ_NUMBERS_LIST_0_THROUGH_32:
        //
        for(uint8_t n = 0; n < 32 ; n++)
          response_buffer[2+n] = n;
        response_length += 32;
        break;

      case V1_READ_NUMBERS_LIST_PUSH_NOTIFICATION_1:
        //
        response_length += pn_read_numbers_list_1(&response_buffer[2]);
        break;

      default:
        valid_id = false;
        break;
    }
    response_buffer[0] = VERSION1;
    response_buffer[1] = valid_id ? OK_STATUS : NOTOK_STATUS;
    if(response_length >= MAX_RESPONSE_SIZE)
    {
      response_buffer[1] = NOTOK_STATUS;
      response_length = MAX_RESPONSE_SIZE-1;
      Serial.println("[NOTOK] response_length exceeded limit");
    }
    return valid_id;    
  } // bool build_read_list_response(uint16_t list_id)

  bool write_integer_handler(uint16_t int_id)
  {
    const uint8_t payload_start = 4;
    bool success = true;
    switch(int_id)
    {
      case V1_WRITE_INT_ID_CLIENT_VERSION:
        if(cmd_request_length == 2+9)  // all 'write integer' inbound packets contain 9 octets except write value
        {
          udp_client_version = cmd_request_buffer[payload_start] + (cmd_request_buffer[payload_start+1] << 8);
          Serial.println("udp_client_version = " + String(udp_client_version));
        }          
        else
        {
          debug_error("cmd_request_length != 6 (" + String(cmd_request_length) + ")");
          success = false;
        }
        break;

      default:
        success = false;
        break;
    }
    return success;
  } // bool write_integer_handler(uint16_t int_id)

  void setup(void)
  {
    udp_client_version = 0x0000;
  }

} // namespace myCH

unsigned ch_handle_char_buffer_command_message(char * buffer, int length){ return my_CH::handle_char_buffer_command_message(buffer, length); }
uint8_t * ch_response_buffer(void){ return my_CH::response_buffer; }
unsigned ch_response_length(void){ return my_CH::response_length; }
void ch_setup(void){ my_CH::setup(); }
uint16_t ch_udp_client_version(void){ return my_CH::udp_client_version; }
// void ch_reset_response_length(void){ my_CH::response_length=0; }
